music_app/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "xrBfy4sGcTO0RzR08ZUbeg"], ["LIMIT", 1]]
---
    def current_user
        return nil if session[:session_token].nil?
        @current_user = User.find_by(session_token: session[:session_token])