music_app/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE (1) LIMIT $1  [["LIMIT", 1]]
---
    def index
        @bands = Band.all

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Maroon52"], ["updated_at", "2019-11-05 22:07:22.222118"], ["id", 1]]
---
    def update
        @band = Band.find_by(id: params[:id])

        if @band.update_attributes(band_params)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 3]]
---
    def destroy
        band = Band.find_by(id: params[:id])
        band.destroy